Revit 2027 API
AreaReinforcement.SetLayerActive Method
 Sets if the desired layer is active or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayerActive(
	bool active,
	AreaReinforcementLayerType layer
)
Public Sub SetLayerActive (
	active As Boolean,
	layer As AreaReinforcementLayerType
)
public:
void SetLayerActive(
	bool active,
	AreaReinforcementLayerType layer
)
member SetLayerActive :
        active : bool *
        layer : AreaReinforcementLayerType -> unit
Parameters
active Boolean
 True to set the layer to be active, false otherwise.
layer AreaReinforcementLayerType
 The layer type.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace